import 'package:danak/gen/assets.gen.dart';
import 'package:danak/pages/text_page.dart';
import 'package:flutter/material.dart';
import 'package:get/get.dart';

class BannerModels {
  String title;
  String subTitle;
  String image;
  String text;
  VoidCallback onTap;
  BannerModels({
    required this.title,
    required this.subTitle,
    required this.image,
    required this.text,
    required this.onTap,
  });
  static List<BannerModels> getBannerModels() {
    List<BannerModels> bannerModels = [];

    bannerModels.add(
      BannerModels(
        onTap: () => Get.to(
          () => TextPage(),
          arguments: [bannerModels[0].title, bannerModels[0].text],
          transition: Transition.fadeIn,
          duration: Duration(milliseconds: 200),
        ),

        title: "درباره دانشکده مدیریت و اقتصاد بیشتر بدانید",
        subTitle: "محیط، اساتید و کلاس ها",
        image: Assets.images.usb.path,
        text: '''
دانشکده اقتصاد و علوم اداری دانشگاه سیستان و بلوچستان فعالیت خود را در سال ۱۳۷۱ با تأسیس رشته مدیریت دولتی و پذیرش ۹۲ دانشجو در مقطع کارشناسی آغاز کرد. در سال ۱۳۷۲، رشته حسابداری نیز به مجموعه آموزشی این دانشکده افزوده شد. همچنین، گروه اقتصاد کشاورزی از سال ۱۳۷۴ با پذیرش دانشجو در مقطع کارشناسی آغاز به کار کرد و در ادامه، گروه‌های اقتصاد صنعتی و اقتصاد بازرگانی به ترتیب در سال‌های ۱۳۷۵ و ۱۳۷۷ راه‌اندازی شدند.

از سال ۱۳۸۱ به بعد، با فراهم شدن شاخص‌ها و زیرساخت‌های لازم، توسعه چشمگیری در مقاطع تحصیلات تکمیلی شکل گرفت؛ به طوری که یک گرایش جدید در مقطع کارشناسی و هفت گرایش در مقطع کارشناسی ارشد به رشته‌های موجود اضافه شد.

دهه ۱۳۸۰ را می‌توان دوران شکوفایی و رشد چشمگیر این دانشکده دانست. در این دوره، دانشکده موفق شد با ایجاد گرایش‌های مختلفی در حوزه‌های مدیریت (تشکیلات و روش‌ها، مدیریت فناوری اطلاعات با گرایش کسب‌وکار الکترونیکی، مدیریت بازرگانی با گرایش‌های مالی و تحول)، حسابداری، اقتصاد کشاورزی، اقتصاد نظری و مدیریت کارآفرینی (در گرایش‌های سازمانی، توسعه، بخش عمومی و کسب‌وکار جدید)، در مقاطع کارشناسی ارشد و دکتری، پذیرای دانشجویان از سراسر کشور باشد.

در حال حاضر، دانشکده دارای هفت رشته در مقطع کارشناسی، ۱۴ گرایش در مقطع کارشناسی ارشد و ۹ گرایش در مقطع دکتری است. تعداد دانشجویان این دانشکده ۱۲۶۰ نفر بوده و کادر آموزشی آن شامل ۲۸ عضو هیئت علمی ثابت و ۳۳ عضو هیئت علمی مدعو است. همچنین، چهار نفر از اعضای هیئت علمی دانشکده در حال حاضر به منظور ادامه تحصیل در مقطع دکتری، در دانشگاه‌های داخل و خارج از کشور مأمور به تحصیل هستند.

شایان ذکر است که بسیاری از فارغ‌التحصیلان مقطع کارشناسی این دانشکده در سال‌های اخیر، موفق به کسب رتبه‌های برتر در آزمون کارشناسی ارشد شده و وارد مقاطع تحصیلات تکمیلی شده‌اند؛ که این مهم، بیانگر توانمندی و شایستگی اعضای هیئت علمی دانشکده است.

دانشکده اقتصاد و علوم اداری دارای امکاناتی از جمله سالن سمعی–بصری، مرکز رایانه ویژه دانشجویان تحصیلات تکمیلی و کلاس‌های مجهز به سیستم ویدئو پروژکتور می‌باشد. همچنین انجمن‌های علمی گروه‌های مدیریت و اقتصاد نیز از سال ۱۳۸۰ در این دانشکده فعالیت خود را آغاز کرده‌اند و از جمله انجمن‌های علمی فعال در سطح دانشگاه به شمار می‌روند.
''',
      ),
    );
    bannerModels.add(
      BannerModels(
        onTap: () {},
        title: "درباره دانشکده مدیریت و اقتصاد بیشتر بدانید",
        subTitle: "محیط، اساتید و کلاس ها",
        image: Assets.images.usb.path,
        text: '''
دانشکده اقتصاد و علوم اداری دانشگاه سیستان و بلوچستان فعالیت خود را در سال ۱۳۷۱ با تأسیس رشته مدیریت دولتی و پذیرش ۹۲ دانشجو در مقطع کارشناسی آغاز کرد. در سال ۱۳۷۲، رشته حسابداری نیز به مجموعه آموزشی این دانشکده افزوده شد. همچنین، گروه اقتصاد کشاورزی از سال ۱۳۷۴ با پذیرش دانشجو در مقطع کارشناسی آغاز به کار کرد و در ادامه، گروه‌های اقتصاد صنعتی و اقتصاد بازرگانی به ترتیب در سال‌های ۱۳۷۵ و ۱۳۷۷ راه‌اندازی شدند.

از سال ۱۳۸۱ به بعد، با فراهم شدن شاخص‌ها و زیرساخت‌های لازم، توسعه چشمگیری در مقاطع تحصیلات تکمیلی شکل گرفت؛ به طوری که یک گرایش جدید در مقطع کارشناسی و هفت گرایش در مقطع کارشناسی ارشد به رشته‌های موجود اضافه شد.

دهه ۱۳۸۰ را می‌توان دوران شکوفایی و رشد چشمگیر این دانشکده دانست. در این دوره، دانشکده موفق شد با ایجاد گرایش‌های مختلفی در حوزه‌های مدیریت (تشکیلات و روش‌ها، مدیریت فناوری اطلاعات با گرایش کسب‌وکار الکترونیکی، مدیریت بازرگانی با گرایش‌های مالی و تحول)، حسابداری، اقتصاد کشاورزی، اقتصاد نظری و مدیریت کارآفرینی (در گرایش‌های سازمانی، توسعه، بخش عمومی و کسب‌وکار جدید)، در مقاطع کارشناسی ارشد و دکتری، پذیرای دانشجویان از سراسر کشور باشد.

در حال حاضر، دانشکده دارای هفت رشته در مقطع کارشناسی، ۱۴ گرایش در مقطع کارشناسی ارشد و ۹ گرایش در مقطع دکتری است. تعداد دانشجویان این دانشکده ۱۲۶۰ نفر بوده و کادر آموزشی آن شامل ۲۸ عضو هیئت علمی ثابت و ۳۳ عضو هیئت علمی مدعو است. همچنین، چهار نفر از اعضای هیئت علمی دانشکده در حال حاضر به منظور ادامه تحصیل در مقطع دکتری، در دانشگاه‌های داخل و خارج از کشور مأمور به تحصیل هستند.

شایان ذکر است که بسیاری از فارغ‌التحصیلان مقطع کارشناسی این دانشکده در سال‌های اخیر، موفق به کسب رتبه‌های برتر در آزمون کارشناسی ارشد شده و وارد مقاطع تحصیلات تکمیلی شده‌اند؛ که این مهم، بیانگر توانمندی و شایستگی اعضای هیئت علمی دانشکده است.

دانشکده اقتصاد و علوم اداری دارای امکاناتی از جمله سالن سمعی–بصری، مرکز رایانه ویژه دانشجویان تحصیلات تکمیلی و کلاس‌های مجهز به سیستم ویدئو پروژکتور می‌باشد. همچنین انجمن‌های علمی گروه‌های مدیریت و اقتصاد نیز از سال ۱۳۸۰ در این دانشکده فعالیت خود را آغاز کرده‌اند و از جمله انجمن‌های علمی فعال در سطح دانشگاه به شمار می‌روند.
''',
      ),
    );

    return bannerModels;
  }
}
